{
  "radio": {
    "id": "venus-sw6b",
    "manufacturer": "Venus",
    "model": "SW-6B",
    "revision": "2024-08",
    "pdfFilename": "SW-6B_Manual.pdf"
  },
  "sections": [
    {
      "id": "operation-basics",
      "title": "Operation Basics",
      "blocks": [
        {
          "type": "paragraph",
          "text": "The SW-6B is a six-band CW QRP transceiver with simple and practical features and straightforward operation, making it the best choice for field setups, outings and other activities."
        },
        {
          "type": "paragraph",
          "text": "Two versions are available: one with metal enclosure, the other with plastic enclosure. All hardware and functionalities are the same."
        },
        {
          "type": "paragraph",
          "text": "ON/OFF: Push up to turn on the SW-6B radio set."
        },
        {
          "type": "paragraph",
          "text": "Band switch (BAND): The switch labeled BAND on the right side of the panel is a band selector switch. Switch positions 1, 2, 3, 4 and 5 correspond to 80m, 60m, 40m, 20m, 17m/15m bands respectively (17m and 15m share a common band)."
        },
        {
          "type": "paragraph",
          "text": "M/V/S button: Pressing this button alternates the display between Memory mode (M) and VFO (V) mode. The display will show M-# or V-#, where # represents the numbers 1 thru 8. In Memory mode, the Tune knob changes memory locations. In VFO Mode, the Tune knob changes the displayed frequency."
        },
        {
          "type": "paragraph",
          "text": "Pressing and holding the M/V/S key for more than two seconds will display SAVE and the current frequency and mode will be stored in the memory location displayed."
        },
        {
          "type": "note",
          "text": "The last stored frequency and operating mode will be entered each time the unit is turned on."
        }
      ]
    },
    {
      "id": "rit-xit-mode",
      "title": "RIT/XIT and Mode Selection",
      "blocks": [
        {
          "type": "paragraph",
          "text": "RIT/M button: Press the RIT/M button briefly to enter the RIT/XIT (offset) function."
        },
        {
          "type": "paragraph",
          "text": "To switch between RIT and XIT, momentarily press down on the Tune (VFO) knob. Moving the VFO knob changes the amount of offset in both RIT and XIT. Turning the VFO knob clockwise increases the offset; turning anticlockwise decreases it."
        },
        {
          "type": "paragraph",
          "text": "The function, when active, shows on the screen on the right side of the top display line. This also shows the direction of offset (+ or -) from the displayed VFO frequency and the amount of offset. The carrot (triangle) indicates steps selected for offset tuning. RIT changes will be in 10 Hz/step and XIT changes will be in 100 Hz/step."
        },
        {
          "type": "paragraph",
          "text": "Pressing the RIT/M button for more than 1 second will change the operating mode. Every time the button is pressed for 2 seconds the operating mode will change in the order of: CW, CWR, USB, LSB."
        },
        {
          "type": "note",
          "text": "You may transmit CW signals when in SSB mode, enabling CW/SSB cross-mode operation."
        }
      ]
    },
    {
      "id": "frequency-tuning",
      "title": "Frequency and Tuning",
      "blocks": [
        {
          "type": "paragraph",
          "text": "The frequency of the VFO is changed by the large knob to the left of the display. This VFO control is used for several functions."
        },
        {
          "type": "paragraph",
          "text": "The frequency change steps are 100KHz, 1KHz, 100Hz and 10Hz. The carrot (triangle) above the listed frequency shows the steps in use."
        },
        {
          "type": "paragraph",
          "text": "By briefly pressing down the VFO control, the carrot moves to the next digit to the right. The frequency steps will change to the opposite direction (R to L) if the VFO control is pressed for more than 1 second."
        },
        {
          "type": "note",
          "text": "If the VFO control is pressed down while in MEM mode, the radio set will enter VFO mode."
        }
      ]
    },
    {
      "id": "cw-keyer",
      "title": "CW/Keyer Settings",
      "blocks": [
        {
          "type": "paragraph",
          "text": "Speed adjustment knob (SPEED): The SPEED knob near the bottom left of the panel controls the keyer speed. It increases by turning clockwise and slows by turning counterclockwise."
        },
        {
          "type": "paragraph",
          "text": "M1, M2 buttons: These are two auto-call buttons where two auto-call messages can be pre-stored. Briefly press M1 or M2 then release immediately to automatically start the stored content. To cancel auto-call during playback, briefly press M1 or M2 and release."
        },
        {
          "type": "paragraph",
          "text": "Entering memory characters (requires paddles, not straight key): Press and hold M1 or M2 for about 2 seconds. After hearing the Morse code letter I, release the button. Enter your message string (~20 characters). Quickly press the CQ button to hear the Morse code letter E to Exit."
        },
        {
          "type": "paragraph",
          "text": "Sidetone volume adjustment: To the left of the SPEED knob, there is a ST adjustment hole. Use a small flat blade screwdriver. Turn clockwise to increase volume, counterclockwise to decrease."
        },
        {
          "type": "note",
          "text": "Storage capacity is approximately 20 characters. If exceeded, the memory will be emptied."
        }
      ]
    },
    {
      "id": "connections",
      "title": "Connections",
      "blocks": [
        {
          "type": "paragraph",
          "text": "External power supply: Any stable, clean 10-14VDC source may be used via the 5.5mm x 2.1mm power connector. Reverse polarity protected."
        },
        {
          "type": "paragraph",
          "text": "Internal battery: There is space for an internal battery, a three-cell 18650 lithium battery pack (voltage 11-12.6V). If installed, you may still use external power. The external supply voltage must be higher than the built-in battery voltage."
        },
        {
          "type": "paragraph",
          "text": "CHARGE connector: For charging the internal battery. Use a lithium battery charger for built-in battery charging."
        },
        {
          "type": "paragraph",
          "text": "Antenna: Any resonant/well-matched (50 Ohm) antenna may be connected to the ANT jack BNC connector. An external antenna tuner is required for non-resonant antennas."
        },
        {
          "type": "paragraph",
          "text": "Headphones: Connect a stereo headset to the PHONE jack. Impedance should be 8-32 Ohms. A stereo connector must be used."
        },
        {
          "type": "warning",
          "text": "A MONO headphone plug will SHORT the output! A 90-degree connector is recommended to reduce strain on the jack."
        },
        {
          "type": "paragraph",
          "text": "Key/Paddle: If using a stereo plug for a straight key, both ring and sleeve must be connected together. A monaural plug may also be used with a straight key. The radio detects the type of key used. With paddles and stereo plug, the internal keyer is automatically enabled on power up (annunciated with letter 'A'). Letter 'M' is heard if a straight key is connected."
        }
      ]
    },
    {
      "id": "transmitting",
      "title": "Transmitting",
      "blocks": [
        {
          "type": "paragraph",
          "text": "Permitted transmitting frequencies: 3.5-3.8MHz (80m), 5.35-5.368MHz (60m), 7.0-7.2MHz (40m), 14-14.35MHz (20m), 18.068-18.168MHz (17m), and 21.0-21.45MHz (15m)."
        },
        {
          "type": "paragraph",
          "text": "When transmitting within listed frequency ranges, the display shows TX and the S-meter changes to show transmitting power with P. The OP red indicator light at the top right of the panel flashes when transmitting."
        },
        {
          "type": "paragraph",
          "text": "Power meter: There are 3 pips on the P bar graph. The first pip is roughly 1 Watt, the second roughly 3 Watts, and the final pip is roughly 5 Watts."
        },
        {
          "type": "paragraph",
          "text": "Out of band operation: When attempting to transmit outside permitted frequencies, the display shows ERR. The radio will not transmit, but sidetone can still be heard. Use this feature for code practice."
        },
        {
          "type": "note",
          "text": "The power displayed is accurate only when the standing wave is close to 1:1 (matched or resonant antenna)."
        }
      ]
    },
    {
      "id": "swr-tuning",
      "title": "SWR Indicator and Tuning",
      "blocks": [
        {
          "type": "paragraph",
          "text": "OP/TUNE Switch: This switch employs the Tayloe type SWR indicator. When in the TUNE position, a 50 ohm bridge is placed in line with the antenna connector."
        },
        {
          "type": "paragraph",
          "text": "Following your antenna tuner instructions, tune for maximum noise in receive. When transmitting (a series of 'dits' is recommended), the LED above the switch will glow if there is not a correct match. Making fine adjustments will cause the LED to fully extinguish or grow very dim."
        },
        {
          "type": "paragraph",
          "text": "When the LED is fully extinguished or very dim, you have a good match between the SW-6B and the antenna. If a fully resonant antenna is employed, the LED will remain dim or dark."
        },
        {
          "type": "note",
          "text": "If you wish to operate at lower power levels, you may leave the switch in the TUNE position or reduce the input voltage. When tuning is complete, place the switch back into the OP position."
        },
        {
          "type": "warning",
          "text": "High SWR will likely damage the radio over time. Use care when tuning any antenna. It is strongly suggested to use a series of 'dits' to reduce chance of damage to the final amplifier while tuning."
        }
      ]
    },
    {
      "id": "display-settings",
      "title": "Display Settings",
      "blocks": [
        {
          "type": "paragraph",
          "text": "Screen brightness settings: Press and hold the M/V/S button and RIT/M button at the same time to enter screen brightness setting mode."
        },
        {
          "type": "paragraph",
          "text": "Once in this mode, rotate the VFO control to change the screen brightness. The brightness has 5 levels: Level 1 is darkest, Level 5 is brightest."
        },
        {
          "type": "paragraph",
          "text": "Press and hold M/V/S and RIT/M again at the same time to exit the screen brightness setting state."
        }
      ]
    },
    {
      "id": "frequency-calibration",
      "title": "Frequency Calibration",
      "blocks": [
        {
          "type": "paragraph",
          "text": "DDS frequency calibration: Turn off power, press and hold M/V/S and RIT/M buttons at the same time, then turn on power. Keep holding for about 3 seconds and release when the display shows OUTPUT 10.000.00MHz."
        },
        {
          "type": "paragraph",
          "text": "Use a calibrated frequency meter to detect the frequency of the TEST point on the PCB board (near pin 1 of IC7). Rotate the large knob to adjust frequency until the meter displays 10.000.00MHz. Lightly press M/V/S to exit and enter IF frequency calibration."
        },
        {
          "type": "paragraph",
          "text": "IF frequency calibration: After exiting DDS calibration, the display shows IF frequency. Access a signal source at the antenna end, adjust to 7.023MHz, rotate large knob to adjust IF frequency to maximum received signal strength. Tap M/V/S to exit."
        }
      ]
    },
    {
      "id": "specifications",
      "title": "Specifications",
      "blocks": [
        {
          "type": "specificationTable",
          "title": "SW-6B Technical Specifications",
          "rows": [
            ["Frequency Coverage (TX)", "80m, 60m, 40m, 20m, 17m, 15m"],
            [
              "TX Frequencies",
              "3.5-3.8, 5.35-5.368, 7.0-7.2, 14.0-14.35, 18.068-18.168, 21.0-21.45 MHz"
            ],
            ["RX Frequencies", "3-5, 5-6, 6-8, 8-16, 16-22 MHz"],
            ["Modes", "CW, CWR, USB, LSB"],
            ["Output Power", "~5W @ 12VDC"],
            ["Operating Voltage", "10-14VDC (reverse polarity protected)"],
            ["Current (RX)", "~70mA (speaker off), ~100mA (speaker on)"],
            ["Current (TX)", "0.7 to 0.8A @ 12VDC"],
            ["CW Filter Bandwidth", "~400Hz"],
            ["SSB Filter Bandwidth", "~2KHz"],
            ["RIT Range", "-9KHz to +9KHz (10Hz steps)"],
            ["XIT Range", "-30KHz to +30KHz (100Hz steps)"],
            ["Sidetone", "600Hz"],
            ["Memory Channels", "8 per band (17m/15m shared)"],
            ["Size (Metal)", "160 x 110 x 55mm (6.3 x 4.3 x 2.2 in)"],
            ["Size (Plastic)", "170 x 120 x 72mm (6.7 x 4.7 x 2.8 in)"],
            ["Weight (Metal)", "520g / 1.14 lbs (660g with battery)"],
            ["Weight (Plastic)", "480g / 1.05 lbs (620g with battery)"],
            ["Internal Battery", "3-cell 18650 Li-ion (11-12.6V)"],
            ["Antenna Connector", "BNC"],
            ["Headphone Jack", "3.5mm stereo (8-32 ohms)"]
          ]
        }
      ]
    }
  ]
}
